In [1]:
# Imports
#import numpy as np
import pandas as pd
#import matplotlib.pyplot as plt
#import seaborn as sns
#import json

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine

In [2]:
basics_df = pd.read_csv('Data/title_basics.csv.gz')
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography"
1,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama
2,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy"
3,tt0001184,movie,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,NaN,58,"Adventure,Drama"
4,tt0001285,movie,The Life of Moses,The Life of Moses,0,1909,NaN,50,"Biography,Drama,Family"

In [3]:
#Convert the single string of genres from title bassics into new tables
basics_df['genres_split'] = basics_df['genres'].str.split(',')

In [4]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography","[Action, Adventure, Biography]"
1,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama,[Drama]
2,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy","[Adventure, Fantasy]"
3,tt0001184,movie,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,NaN,58,"Adventure,Drama","[Adventure, Drama]"
4,tt0001285,movie,The Life of Moses,The Life of Moses,0,1909,NaN,50,"Biography,Drama,Family","[Biography, Drama, Family]"

In [5]:
exploded_genres = basics_df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography",Action
0,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography",Adventure
0,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography",Biography
1,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama,Drama
2,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy",Adventure
...,...,...,...,...,...,...,...,...,...,...
354619,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
354620,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama
354621,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015,NaN,57,Documentary,Documentary
354622,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007,NaN,100,Documentary,Documentary
354623,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013,NaN,49,Documentary,Documentary

In [6]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Family',
 'Fantasy',
 'Film-Noir',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [7]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres

           tconst genres_split
0       tt0000574       Action
0       tt0000574    Adventure
0       tt0000574    Biography
1       tt0000591        Drama
2       tt0000679    Adventure
...           ...          ...
354619  tt9916362      History
354620  tt9916538        Drama
354621  tt9916622  Documentary
354622  tt9916680  Documentary
354623  tt9916754  Documentary

[583156 rows x 2 columns]

In [8]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Documentary': 7,
 'Drama': 8,
 'Family': 9,
 'Fantasy': 10,
 'Film-Noir': 11,
 'Game-Show': 12,
 'History': 13,
 'Horror': 14,
 'Music': 15,
 'Musical': 16,
 'Mystery': 17,
 'News': 18,
 'Reality-TV': 19,
 'Romance': 20,
 'Sci-Fi': 21,
 'Short': 22,
 'Sport': 23,
 'Talk-Show': 24,
 'Thriller': 25,
 'War': 26,
 'Western': 27}

In [9]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [10]:
title_genres.head()

      tconst  genre_id
0  tt0000574         0
0  tt0000574         2
0  tt0000574         4
1  tt0000591         8
2  tt0000679         2

In [11]:
genres_df = pd.DataFrame({'genre_name': genre_map.keys(),
                           'genre_id': genre_map.values()})

In [12]:
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [13]:
database_name = "Movies"
connection_str = f"mysql+pymysql://root:root@localhost/{database_name}"

In [14]:
engine = create_engine(connection_str)

In [15]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [16]:
basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography","[Action, Adventure, Biography]"
1,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama,[Drama]
2,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy","[Adventure, Fantasy]"
3,tt0001184,movie,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,NaN,58,"Adventure,Drama","[Adventure, Drama]"
4,tt0001285,movie,The Life of Moses,The Life of Moses,0,1909,NaN,50,"Biography,Drama,Family","[Biography, Drama, Family]"

In [17]:
basics_df = basics_df.drop(columns = ['titleType', 'originalTitle',
                            'isAdult', 'endYear', 'genres', 'genres_split'])

In [18]:
from sqlalchemy.types import *
key_len = basics_df['tconst'].fillna('').map(len).max()
title_len = basics_df['primaryTitle'].fillna('').map(len).max()

df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

In [19]:
basics_df.to_sql('title_basics',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [20]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [21]:
q = """
SELECT * 
FROM title_basics LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst                    primaryTitle  startYear  runtimeMinutes
0  tt0000574     The Story of the Kelly Gang       1906              70
1  tt0000591                The Prodigal Son       1907              90
2  tt0000679  The Fairylogue and Radio-Plays       1908             120
3  tt0001184         Don Juan de Serrallonga       1910              58
4  tt0001285               The Life of Moses       1909              50

In [22]:
rating_df = pd.read_csv('Data/rating.csv.gz')

In [23]:
rating_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1879
1  tt0000002            5.9       248
2  tt0000003            6.5      1653
3  tt0000004            5.8       161
4  tt0000005            6.2      2479

In [24]:
key_len = rating_df['tconst'].fillna('').map(len).max()

df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

In [25]:
rating_df.to_sql('title_ratings',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [26]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [27]:
title_genres.head()

      tconst  genre_id
0  tt0000574         0
0  tt0000574         2
0  tt0000574         4
1  tt0000591         8
2  tt0000679         2

In [28]:
tconst_len = title_genres['tconst'].fillna('').map(len).max()

df_schema = {
    "tconst": String(tconst_len+1), 
    'genre_id':Integer()}

In [29]:
title_genres.to_sql('title_genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [30]:
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [31]:
key_len = genres_df['genre_name'].fillna('').map(len).max()
df_schema = {
    "genre_id": Integer(), 
    'genre_name': String(key_len+1)}

In [32]:
genres_df.to_sql('genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [33]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')